/*************************************************************************
	> File Name: main.c
	> Author: zhenkai
	> Mail: 996.icu.cn@gmail.com 
	> Created Time: 一  9/ 9 16:34:14 2019
 ************************************************************************/

/*题目：古典问题（兔子生崽）：有一对兔子，从出生后第3个月起每个月都生一对兔子，小兔子长到第三个月后每个月又生一对兔子，假如兔子都不死，问每个月的兔子总数为多少？（输出前40个月即可）

程序分析：兔子的规律为数列1,1,2,3,5,8,13,21....，即下个月是上两个月之和（从第三个月开始）。*/

#include<stdio.h>

int main()
{
	int l1 = 1, l2 = 1, i;
	for (i = 1; i <= 20; i++){     // 40个月需要循环20次
		printf("%12d%12d", l1, l2);
		if (i % 2 == 0){
			printf("\n");
		}
		l1 = l1 + l2;
		l2 = l1 + l2;
	}
	return 0;
}
