/*************************************************************************
	> File Name: main.c
	> Author: zhenkai
	> Mail: 996.icu.cn@gmail.com 
	> Created Time: 一  9/ 9 18:14:54 2019
 ************************************************************************/

/*打印出所有的"水仙花数"，所谓"水仙花数"是指一个三位数，其各位数字立方和等于该数 本身。
  例如：153是一个"水仙花数"，因为153=1的三次方＋5的三次方＋3的三次方。*/


#include<stdio.h>

int main()
{
	int i, j, k, sum;

	printf("打印出所有的水仙花数:\n");
	for (sum = 1; sum <= 1000; sum++){
		i = sum % 10;
		j = sum / 10 % 10;
		k = sum / 100 % 10;

		if (sum == i*i*i + j*j*j + k*k*k)
			printf("%d\n", sum);

	}
	return 0;
}
