/*************************************************************************
	> File Name: main.c
	> Author: zhenkai
	> Mail: 996.icu.cn@gmail.com 
	> Created Time: 三  9/18 18:08:45 2019
 ************************************************************************/

/*题目：一球从100米高度自由落下，每次落地后反跳回原高度的一半；再落下，求它在第10次落地时，共经过多少米？第10次反弹多高？*/

#include<stdio.h>


int main()
{
	float s, h;
	s = h = 100;
	h = h / 2;
	for (int i = 2; i <= 100; i++)
	{
		s += 2 * h;
		h = h / 2;
		printf("%f\n", h);
	}
	printf("%f %f\n", s, h);
	return 0;
}

